#tuple时一种不可变的数据类型，用于存储多个元素

#创建tuple
t = (1, 2, 3)
print(t)  # 输出: (1, 2, 3)

t = 1, 2, 3
print(t)  # 输出: (1, 2, 3)

single = (1,)
print(single)  # 输出: (1,)

empty = ()
print(empty)  # 输出: ()

#访问元组
t = (10, 20, 30, 40)
print(t[0])  # 输出: 10
print(t[2])  # 输出: 30

print(t[-1])  # 输出: 40
print(t[-2])  # 输出: 30
print(t[1:3])  # 输出: (20, 30)

#元组不可改变，如果需要改变则需要通过创建新的元组来实现
t = (1, 2, 3)
t = (10,) + t[1:]
print(t)  # 输出: (10, 2, 3)


#常用操作

#解包
t = (1, 2, 3)
a, b, c = t
print(a, b, c)  # 输出: 1 2 3
#连接
t1 = (1, 2)
t2 = (3, 4)
t3 = t1 + t2
print(t3)  # 输出: (1, 2, 3, 4)
#重复
t = (1, 2)
print(t * 3)  # 输出: (1, 2, 1, 2, 1, 2)
